{"format": "graph-model", "generatedBy": "2.19.0", "convertedBy": "TensorFlow.js Converter v4.22.0", "signature": {"inputs": {"feature_input": {"name": "feature_input:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "121"}]}}, "landmark_input": {"name": "landmark_input:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "63"}]}}}, "outputs": {"output_0": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "28"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/ASL_Hybrid_CNN_1/reshape_landmarks_1/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/ASL_Hybrid_CNN_1/reshape_landmarks_1/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/ASL_Hybrid_CNN_1/reshape_landmarks_1/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/ASL_Hybrid_CNN_1/reshape_landmarks_1/Reshape/shape/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/ASL_Hybrid_CNN_1/reshape_landmarks_1/Reshape/shape/2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/ASL_Hybrid_CNN_1/conv1_1/convolution/ExpandDims/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/ASL_Hybrid_CNN_1/conv1_1/convolution/ExpandDims_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "3"}, {"size": "3"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/ASL_Hybrid_CNN_1/conv1_1/Squeeze", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/ASL_Hybrid_CNN_1/bn1_1/batchnorm/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/ASL_Hybrid_CNN_1/bn1_1/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/ASL_Hybrid_CNN_1/conv2_1/convolution/ExpandDims/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/ASL_Hybrid_CNN_1/conv2_1/convolution/ExpandDims_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "3"}, {"size": "64"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/ASL_Hybrid_CNN_1/conv2_1/Squeeze", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/ASL_Hybrid_CNN_1/bn2_1/batchnorm/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/ASL_Hybrid_CNN_1/bn2_1/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/ASL_Hybrid_CNN_1/pool1_1/MaxPool1d/ExpandDims/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/ASL_Hybrid_CNN_1/conv3_1/convolution/ExpandDims/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/ASL_Hybrid_CNN_1/conv3_1/convolution/ExpandDims_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "3"}, {"size": "128"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/ASL_Hybrid_CNN_1/conv3_1/Squeeze", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/ASL_Hybrid_CNN_1/bn3_1/batchnorm/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/ASL_Hybrid_CNN_1/bn3_1/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/ASL_Hybrid_CNN_1/conv4_1/convolution/ExpandDims/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/ASL_Hybrid_CNN_1/conv4_1/convolution/ExpandDims_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "3"}, {"size": "256"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/ASL_Hybrid_CNN_1/conv4_1/Squeeze", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/ASL_Hybrid_CNN_1/bn4_1/batchnorm/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/ASL_Hybrid_CNN_1/bn4_1/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/ASL_Hybrid_CNN_1/gap_1/Mean/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/ASL_Hybrid_CNN_1/cnn_dense_1/Cast/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/ASL_Hybrid_CNN_1/cnn_dense_1/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/ASL_Hybrid_CNN_1/feat_dense1_1/Cast/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "121"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/ASL_Hybrid_CNN_1/feat_dense1_1/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/ASL_Hybrid_CNN_1/feat_bn1_1/batchnorm/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/ASL_Hybrid_CNN_1/feat_bn1_1/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/ASL_Hybrid_CNN_1/feat_dense2_1/Cast/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/ASL_Hybrid_CNN_1/feat_dense2_1/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/ASL_Hybrid_CNN_1/feat_bn2_1/batchnorm/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/ASL_Hybrid_CNN_1/feat_bn2_1/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/ASL_Hybrid_CNN_1/merge_1/concat/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/ASL_Hybrid_CNN_1/final_dense1_1/Cast/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/ASL_Hybrid_CNN_1/final_dense1_1/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/ASL_Hybrid_CNN_1/final_bn1_1/batchnorm/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/ASL_Hybrid_CNN_1/final_bn1_1/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/ASL_Hybrid_CNN_1/final_dense2_1/Cast/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/ASL_Hybrid_CNN_1/final_dense2_1/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/ASL_Hybrid_CNN_1/output_1/Cast/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "28"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/ASL_Hybrid_CNN_1/output_1/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "28"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "feature_input", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "121"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "landmark_input", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "63"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/ASL_Hybrid_CNN_1/feat_dense1_1/Relu", "op": "_FusedMatMul", "input": ["feature_input", "StatefulPartitionedCall/ASL_Hybrid_CNN_1/feat_dense1_1/Cast/ReadVariableOp", "StatefulPartitionedCall/ASL_Hybrid_CNN_1/feat_dense1_1/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "num_args": {"i": "1"}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/ASL_Hybrid_CNN_1/reshape_landmarks_1/Shape", "op": "Shape", "input": ["landmark_input"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_SHAPE_TENSOR", "args": [{"typeId": "TFT_INT32"}]}]}}, {"name": "StatefulPartitionedCall/ASL_Hybrid_CNN_1/feat_bn1_1/batchnorm/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/ASL_Hybrid_CNN_1/feat_dense1_1/Relu", "StatefulPartitionedCall/ASL_Hybrid_CNN_1/feat_bn1_1/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/ASL_Hybrid_CNN_1/reshape_landmarks_1/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/ASL_Hybrid_CNN_1/reshape_landmarks_1/Shape", "StatefulPartitionedCall/ASL_Hybrid_CNN_1/reshape_landmarks_1/strided_slice/stack", "StatefulPartitionedCall/ASL_Hybrid_CNN_1/reshape_landmarks_1/strided_slice/stack_1", "StatefulPartitionedCall/ASL_Hybrid_CNN_1/reshape_landmarks_1/strided_slice/stack_2"], "attr": {"shrink_axis_mask": {"i": "1"}, "Index": {"type": "DT_INT32"}, "new_axis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "end_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/ASL_Hybrid_CNN_1/feat_bn1_1/batchnorm/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/ASL_Hybrid_CNN_1/feat_bn1_1/batchnorm/mul_1", "StatefulPartitionedCall/ASL_Hybrid_CNN_1/feat_bn1_1/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/ASL_Hybrid_CNN_1/reshape_landmarks_1/Reshape/shape", "op": "Pack", "input": ["StatefulPartitionedCall/ASL_Hybrid_CNN_1/reshape_landmarks_1/strided_slice", "StatefulPartitionedCall/ASL_Hybrid_CNN_1/reshape_landmarks_1/Reshape/shape/1", "StatefulPartitionedCall/ASL_Hybrid_CNN_1/reshape_landmarks_1/Reshape/shape/2"], "attr": {"N": {"i": "3"}, "axis": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/ASL_Hybrid_CNN_1/feat_dense2_1/Relu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/ASL_Hybrid_CNN_1/feat_bn1_1/batchnorm/add_1", "StatefulPartitionedCall/ASL_Hybrid_CNN_1/feat_dense2_1/Cast/ReadVariableOp", "StatefulPartitionedCall/ASL_Hybrid_CNN_1/feat_dense2_1/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "num_args": {"i": "1"}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/ASL_Hybrid_CNN_1/reshape_landmarks_1/Reshape", "op": "Reshape", "input": ["landmark_input", "StatefulPartitionedCall/ASL_Hybrid_CNN_1/reshape_landmarks_1/Reshape/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/ASL_Hybrid_CNN_1/feat_bn2_1/batchnorm/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/ASL_Hybrid_CNN_1/feat_dense2_1/Relu", "StatefulPartitionedCall/ASL_Hybrid_CNN_1/feat_bn2_1/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/ASL_Hybrid_CNN_1/conv1_1/convolution/ExpandDims", "op": "ExpandDims", "input": ["StatefulPartitionedCall/ASL_Hybrid_CNN_1/reshape_landmarks_1/Reshape", "StatefulPartitionedCall/ASL_Hybrid_CNN_1/conv1_1/convolution/ExpandDims/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/ASL_Hybrid_CNN_1/feat_bn2_1/batchnorm/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/ASL_Hybrid_CNN_1/feat_bn2_1/batchnorm/mul_1", "StatefulPartitionedCall/ASL_Hybrid_CNN_1/feat_bn2_1/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/ASL_Hybrid_CNN_1/conv1_1/convolution", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/ASL_Hybrid_CNN_1/conv1_1/convolution/ExpandDims", "StatefulPartitionedCall/ASL_Hybrid_CNN_1/conv1_1/convolution/ExpandDims_1", "StatefulPartitionedCall/ASL_Hybrid_CNN_1/conv1_1/Squeeze"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "data_format": {"s": "TkhXQw=="}, "filter_format": {"s": "SFdJTw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/ASL_Hybrid_CNN_1/conv1_1/BiasAdd", "op": "Squeeze", "input": ["StatefulPartitionedCall/ASL_Hybrid_CNN_1/conv1_1/convolution"], "attr": {"T": {"type": "DT_FLOAT"}, "squeeze_dims": {"list": {"i": ["-3"]}}}}, {"name": "StatefulPartitionedCall/ASL_Hybrid_CNN_1/conv1_1/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/ASL_Hybrid_CNN_1/conv1_1/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/ASL_Hybrid_CNN_1/bn1_1/batchnorm/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/ASL_Hybrid_CNN_1/conv1_1/Relu", "StatefulPartitionedCall/ASL_Hybrid_CNN_1/bn1_1/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/ASL_Hybrid_CNN_1/bn1_1/batchnorm/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/ASL_Hybrid_CNN_1/bn1_1/batchnorm/mul_1", "StatefulPartitionedCall/ASL_Hybrid_CNN_1/bn1_1/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/ASL_Hybrid_CNN_1/conv2_1/convolution/ExpandDims", "op": "ExpandDims", "input": ["StatefulPartitionedCall/ASL_Hybrid_CNN_1/bn1_1/batchnorm/add_1", "StatefulPartitionedCall/ASL_Hybrid_CNN_1/conv2_1/convolution/ExpandDims/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/ASL_Hybrid_CNN_1/conv2_1/convolution", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/ASL_Hybrid_CNN_1/conv2_1/convolution/ExpandDims", "StatefulPartitionedCall/ASL_Hybrid_CNN_1/conv2_1/convolution/ExpandDims_1", "StatefulPartitionedCall/ASL_Hybrid_CNN_1/conv2_1/Squeeze"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "data_format": {"s": "TkhXQw=="}, "filter_format": {"s": "SFdJTw=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "num_args": {"i": "1"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/ASL_Hybrid_CNN_1/conv2_1/BiasAdd", "op": "Squeeze", "input": ["StatefulPartitionedCall/ASL_Hybrid_CNN_1/conv2_1/convolution"], "attr": {"T": {"type": "DT_FLOAT"}, "squeeze_dims": {"list": {"i": ["-3"]}}}}, {"name": "StatefulPartitionedCall/ASL_Hybrid_CNN_1/conv2_1/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/ASL_Hybrid_CNN_1/conv2_1/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/ASL_Hybrid_CNN_1/bn2_1/batchnorm/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/ASL_Hybrid_CNN_1/conv2_1/Relu", "StatefulPartitionedCall/ASL_Hybrid_CNN_1/bn2_1/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/ASL_Hybrid_CNN_1/bn2_1/batchnorm/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/ASL_Hybrid_CNN_1/bn2_1/batchnorm/mul_1", "StatefulPartitionedCall/ASL_Hybrid_CNN_1/bn2_1/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/ASL_Hybrid_CNN_1/pool1_1/MaxPool1d/ExpandDims", "op": "ExpandDims", "input": ["StatefulPartitionedCall/ASL_Hybrid_CNN_1/bn2_1/batchnorm/add_1", "StatefulPartitionedCall/ASL_Hybrid_CNN_1/pool1_1/MaxPool1d/ExpandDims/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/ASL_Hybrid_CNN_1/pool1_1/MaxPool1d", "op": "MaxPool", "input": ["StatefulPartitionedCall/ASL_Hybrid_CNN_1/pool1_1/MaxPool1d/ExpandDims"], "attr": {"padding": {"s": "VkFMSUQ="}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "ksize": {"list": {"i": ["1", "1", "2", "1"]}}, "strides": {"list": {"i": ["1", "1", "2", "1"]}}}}, {"name": "StatefulPartitionedCall/ASL_Hybrid_CNN_1/pool1_1/MaxPool1d/Squeeze", "op": "Squeeze", "input": ["StatefulPartitionedCall/ASL_Hybrid_CNN_1/pool1_1/MaxPool1d"], "attr": {"T": {"type": "DT_FLOAT"}, "squeeze_dims": {"list": {"i": ["1"]}}}}, {"name": "StatefulPartitionedCall/ASL_Hybrid_CNN_1/conv3_1/convolution/ExpandDims", "op": "ExpandDims", "input": ["StatefulPartitionedCall/ASL_Hybrid_CNN_1/pool1_1/MaxPool1d/Squeeze", "StatefulPartitionedCall/ASL_Hybrid_CNN_1/conv3_1/convolution/ExpandDims/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/ASL_Hybrid_CNN_1/conv3_1/convolution", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/ASL_Hybrid_CNN_1/conv3_1/convolution/ExpandDims", "StatefulPartitionedCall/ASL_Hybrid_CNN_1/conv3_1/convolution/ExpandDims_1", "StatefulPartitionedCall/ASL_Hybrid_CNN_1/conv3_1/Squeeze"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "data_format": {"s": "TkhXQw=="}, "filter_format": {"s": "SFdJTw=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "num_args": {"i": "1"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/ASL_Hybrid_CNN_1/conv3_1/BiasAdd", "op": "Squeeze", "input": ["StatefulPartitionedCall/ASL_Hybrid_CNN_1/conv3_1/convolution"], "attr": {"T": {"type": "DT_FLOAT"}, "squeeze_dims": {"list": {"i": ["-3"]}}}}, {"name": "StatefulPartitionedCall/ASL_Hybrid_CNN_1/conv3_1/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/ASL_Hybrid_CNN_1/conv3_1/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/ASL_Hybrid_CNN_1/bn3_1/batchnorm/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/ASL_Hybrid_CNN_1/conv3_1/Relu", "StatefulPartitionedCall/ASL_Hybrid_CNN_1/bn3_1/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/ASL_Hybrid_CNN_1/bn3_1/batchnorm/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/ASL_Hybrid_CNN_1/bn3_1/batchnorm/mul_1", "StatefulPartitionedCall/ASL_Hybrid_CNN_1/bn3_1/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/ASL_Hybrid_CNN_1/conv4_1/convolution/ExpandDims", "op": "ExpandDims", "input": ["StatefulPartitionedCall/ASL_Hybrid_CNN_1/bn3_1/batchnorm/add_1", "StatefulPartitionedCall/ASL_Hybrid_CNN_1/conv4_1/convolution/ExpandDims/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/ASL_Hybrid_CNN_1/conv4_1/convolution", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/ASL_Hybrid_CNN_1/conv4_1/convolution/ExpandDims", "StatefulPartitionedCall/ASL_Hybrid_CNN_1/conv4_1/convolution/ExpandDims_1", "StatefulPartitionedCall/ASL_Hybrid_CNN_1/conv4_1/Squeeze"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "data_format": {"s": "TkhXQw=="}, "filter_format": {"s": "SFdJTw=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "num_args": {"i": "1"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/ASL_Hybrid_CNN_1/conv4_1/BiasAdd", "op": "Squeeze", "input": ["StatefulPartitionedCall/ASL_Hybrid_CNN_1/conv4_1/convolution"], "attr": {"T": {"type": "DT_FLOAT"}, "squeeze_dims": {"list": {"i": ["-3"]}}}}, {"name": "StatefulPartitionedCall/ASL_Hybrid_CNN_1/conv4_1/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/ASL_Hybrid_CNN_1/conv4_1/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/ASL_Hybrid_CNN_1/bn4_1/batchnorm/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/ASL_Hybrid_CNN_1/conv4_1/Relu", "StatefulPartitionedCall/ASL_Hybrid_CNN_1/bn4_1/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/ASL_Hybrid_CNN_1/bn4_1/batchnorm/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/ASL_Hybrid_CNN_1/bn4_1/batchnorm/mul_1", "StatefulPartitionedCall/ASL_Hybrid_CNN_1/bn4_1/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/ASL_Hybrid_CNN_1/gap_1/Mean", "op": "Mean", "input": ["StatefulPartitionedCall/ASL_Hybrid_CNN_1/bn4_1/batchnorm/add_1", "StatefulPartitionedCall/ASL_Hybrid_CNN_1/gap_1/Mean/reduction_indices"], "attr": {"T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": false}}}, {"name": "StatefulPartitionedCall/ASL_Hybrid_CNN_1/cnn_dense_1/Relu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/ASL_Hybrid_CNN_1/gap_1/Mean", "StatefulPartitionedCall/ASL_Hybrid_CNN_1/cnn_dense_1/Cast/ReadVariableOp", "StatefulPartitionedCall/ASL_Hybrid_CNN_1/cnn_dense_1/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "leakyrelu_alpha": {"f": 0.2}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/ASL_Hybrid_CNN_1/merge_1/concat", "op": "ConcatV2", "input": ["StatefulPartitionedCall/ASL_Hybrid_CNN_1/cnn_dense_1/Relu", "StatefulPartitionedCall/ASL_Hybrid_CNN_1/feat_bn2_1/batchnorm/add_1", "StatefulPartitionedCall/ASL_Hybrid_CNN_1/merge_1/concat/axis"], "attr": {"N": {"i": "2"}, "Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/ASL_Hybrid_CNN_1/final_dense1_1/Relu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/ASL_Hybrid_CNN_1/merge_1/concat", "StatefulPartitionedCall/ASL_Hybrid_CNN_1/final_dense1_1/Cast/ReadVariableOp", "StatefulPartitionedCall/ASL_Hybrid_CNN_1/final_dense1_1/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "num_args": {"i": "1"}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/ASL_Hybrid_CNN_1/final_bn1_1/batchnorm/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/ASL_Hybrid_CNN_1/final_dense1_1/Relu", "StatefulPartitionedCall/ASL_Hybrid_CNN_1/final_bn1_1/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/ASL_Hybrid_CNN_1/final_bn1_1/batchnorm/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/ASL_Hybrid_CNN_1/final_bn1_1/batchnorm/mul_1", "StatefulPartitionedCall/ASL_Hybrid_CNN_1/final_bn1_1/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/ASL_Hybrid_CNN_1/final_dense2_1/Relu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/ASL_Hybrid_CNN_1/final_bn1_1/batchnorm/add_1", "StatefulPartitionedCall/ASL_Hybrid_CNN_1/final_dense2_1/Cast/ReadVariableOp", "StatefulPartitionedCall/ASL_Hybrid_CNN_1/final_dense2_1/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "leakyrelu_alpha": {"f": 0.2}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/ASL_Hybrid_CNN_1/output_1/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/ASL_Hybrid_CNN_1/final_dense2_1/Relu", "StatefulPartitionedCall/ASL_Hybrid_CNN_1/output_1/Cast/ReadVariableOp", "StatefulPartitionedCall/ASL_Hybrid_CNN_1/output_1/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "num_args": {"i": "1"}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/ASL_Hybrid_CNN_1/output_1/Softmax", "op": "Softmax", "input": ["StatefulPartitionedCall/ASL_Hybrid_CNN_1/output_1/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/ASL_Hybrid_CNN_1/output_1/Softmax"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 2129}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "StatefulPartitionedCall/ASL_Hybrid_CNN_1/reshape_landmarks_1/strided_slice/stack", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/ASL_Hybrid_CNN_1/reshape_landmarks_1/strided_slice/stack_1", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/ASL_Hybrid_CNN_1/reshape_landmarks_1/strided_slice/stack_2", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/ASL_Hybrid_CNN_1/reshape_landmarks_1/Reshape/shape/1", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/ASL_Hybrid_CNN_1/reshape_landmarks_1/Reshape/shape/2", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/ASL_Hybrid_CNN_1/conv1_1/convolution/ExpandDims/dim", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/ASL_Hybrid_CNN_1/conv1_1/convolution/ExpandDims_1", "shape": [1, 3, 3, 64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/ASL_Hybrid_CNN_1/conv1_1/Squeeze", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/ASL_Hybrid_CNN_1/bn1_1/batchnorm/mul", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/ASL_Hybrid_CNN_1/bn1_1/batchnorm/sub", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/ASL_Hybrid_CNN_1/conv2_1/convolution/ExpandDims/dim", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/ASL_Hybrid_CNN_1/conv2_1/convolution/ExpandDims_1", "shape": [1, 3, 64, 128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/ASL_Hybrid_CNN_1/conv2_1/Squeeze", "shape": [128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/ASL_Hybrid_CNN_1/bn2_1/batchnorm/mul", "shape": [128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/ASL_Hybrid_CNN_1/bn2_1/batchnorm/sub", "shape": [128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/ASL_Hybrid_CNN_1/pool1_1/MaxPool1d/ExpandDims/dim", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/ASL_Hybrid_CNN_1/conv3_1/convolution/ExpandDims/dim", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/ASL_Hybrid_CNN_1/conv3_1/convolution/ExpandDims_1", "shape": [1, 3, 128, 256], "dtype": "float32"}, {"name": "StatefulPartitionedCall/ASL_Hybrid_CNN_1/conv3_1/Squeeze", "shape": [256], "dtype": "float32"}, {"name": "StatefulPartitionedCall/ASL_Hybrid_CNN_1/bn3_1/batchnorm/mul", "shape": [256], "dtype": "float32"}, {"name": "StatefulPartitionedCall/ASL_Hybrid_CNN_1/bn3_1/batchnorm/sub", "shape": [256], "dtype": "float32"}, {"name": "StatefulPartitionedCall/ASL_Hybrid_CNN_1/conv4_1/convolution/ExpandDims/dim", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/ASL_Hybrid_CNN_1/conv4_1/convolution/ExpandDims_1", "shape": [1, 3, 256, 256], "dtype": "float32"}, {"name": "StatefulPartitionedCall/ASL_Hybrid_CNN_1/conv4_1/Squeeze", "shape": [256], "dtype": "float32"}, {"name": "StatefulPartitionedCall/ASL_Hybrid_CNN_1/bn4_1/batchnorm/mul", "shape": [256], "dtype": "float32"}, {"name": "StatefulPartitionedCall/ASL_Hybrid_CNN_1/bn4_1/batchnorm/sub", "shape": [256], "dtype": "float32"}, {"name": "StatefulPartitionedCall/ASL_Hybrid_CNN_1/gap_1/Mean/reduction_indices", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/ASL_Hybrid_CNN_1/cnn_dense_1/Cast/ReadVariableOp", "shape": [256, 128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/ASL_Hybrid_CNN_1/cnn_dense_1/BiasAdd/ReadVariableOp", "shape": [128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/ASL_Hybrid_CNN_1/feat_dense1_1/Cast/ReadVariableOp", "shape": [121, 256], "dtype": "float32"}, {"name": "StatefulPartitionedCall/ASL_Hybrid_CNN_1/feat_dense1_1/BiasAdd/ReadVariableOp", "shape": [256], "dtype": "float32"}, {"name": "StatefulPartitionedCall/ASL_Hybrid_CNN_1/feat_bn1_1/batchnorm/mul", "shape": [256], "dtype": "float32"}, {"name": "StatefulPartitionedCall/ASL_Hybrid_CNN_1/feat_bn1_1/batchnorm/sub", "shape": [256], "dtype": "float32"}, {"name": "StatefulPartitionedCall/ASL_Hybrid_CNN_1/feat_dense2_1/Cast/ReadVariableOp", "shape": [256, 128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/ASL_Hybrid_CNN_1/feat_dense2_1/BiasAdd/ReadVariableOp", "shape": [128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/ASL_Hybrid_CNN_1/feat_bn2_1/batchnorm/mul", "shape": [128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/ASL_Hybrid_CNN_1/feat_bn2_1/batchnorm/sub", "shape": [128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/ASL_Hybrid_CNN_1/merge_1/concat/axis", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/ASL_Hybrid_CNN_1/final_dense1_1/Cast/ReadVariableOp", "shape": [256, 256], "dtype": "float32"}, {"name": "StatefulPartitionedCall/ASL_Hybrid_CNN_1/final_dense1_1/BiasAdd/ReadVariableOp", "shape": [256], "dtype": "float32"}, {"name": "StatefulPartitionedCall/ASL_Hybrid_CNN_1/final_bn1_1/batchnorm/mul", "shape": [256], "dtype": "float32"}, {"name": "StatefulPartitionedCall/ASL_Hybrid_CNN_1/final_bn1_1/batchnorm/sub", "shape": [256], "dtype": "float32"}, {"name": "StatefulPartitionedCall/ASL_Hybrid_CNN_1/final_dense2_1/Cast/ReadVariableOp", "shape": [256, 128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/ASL_Hybrid_CNN_1/final_dense2_1/BiasAdd/ReadVariableOp", "shape": [128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/ASL_Hybrid_CNN_1/output_1/Cast/ReadVariableOp", "shape": [128, 28], "dtype": "float32"}, {"name": "StatefulPartitionedCall/ASL_Hybrid_CNN_1/output_1/BiasAdd/ReadVariableOp", "shape": [28], "dtype": "float32"}]}]}